InformationRegisters/ОписаниеНоменклатурыИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ОписаниеНоменклатурыИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕмкостьПотребительскойУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВПотребительскойУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантЧастичногоВыбытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаЧастичногоВыбытияИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантИспользованияЕдиницыХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияЕдиницыХраненияИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотребительскаяУпаковка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпаковкаЧастичногоВыбытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникОписанияНоменклатурыИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыПродукцииИС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алкогольная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Табак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обувь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегкаяПромышленность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фотоаппараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Духи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Велосипеды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КреслаКоляски</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АльтернативныйТабак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УпакованнаяВода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолочнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Антисептики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БАДы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НикотиносодержащаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродукцияИзНатуральногоМеха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зерно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗерна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоковаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольноеПиво</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МорепродуктыПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодконтрольнаяПродукцияСАТУРН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗерноВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПереработкиЗернаВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МясоПодконтрольноеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетеринарныеПрепараты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИгрыИИгрушкиДляДетей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РадиоэлектроннаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТитановаяМеталлопродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукцияПодконтрольнаяВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РастительныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптоволокноИОптоволоконнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПарфюмерныеИКосметическиеСредстваИБытоваяХимия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонсервированнаяПродукцияБезВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительныеМатериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтопительныеПриборы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бакалея</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АлкогольнаяПродукцияДо9Процентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефоныИНоутбуки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПиротехническиеИзделияИСредстваПожарнойБезопасности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КабельнаяПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МоторныеМасла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезалкогольныеНапитки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПивоВПотребительскихУпаковках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехническиеСредстваРеабилитации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскиеИзделия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскиеИзделия20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегкаяПромышленность2025</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхВлажныеПодконтрольныеВЕТИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КормаДляЖивотныхВлажныеБезВЕТИС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул характеристики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПартииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ПартииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецПартии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьСкладскогоЖурналаВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартииВЕТИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СобытияФормИСУНФ/Ext/Module.bsl
#Область СобытияФормИСПереопределяемый

// Устанавливает условное оформление для поля "Характеристика".
//
// Параметры:
//  Форма - УправляемаяФорма - форма, в которой нужно установить условное оформление,
//  ИмяПоляВводаХарактеристики - Строка - имя элемента формы "Характеристика",
//  ПутьКПолюОтбора - Строка - полный путь к реквизиту "Характеристики используются".
//
Процедура УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
	Форма,
	ИмяПоляВводаХарактеристики,
	ПутьКПолюОтбора) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		Возврат;
	КонецЕсли;
																
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаХарактеристики].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<характеристики не используются>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ИмяТЧ = "";
	
	Если ИмяПоляВводаХарактеристики = "ТоварыХарактеристика" Тогда
		ПутьКТЧ = "Объект.Товары";
		ИмяТЧ = "Товары";
		
	ИначеЕсли ИмяПоляВводаХарактеристики = "СырьеХарактеристика" Тогда
		ПутьКТЧ = "Объект.Сырье";
		ИмяТЧ = "Сырье";
	Иначе Возврат;
	КонецЕсли;
	
	НовыеРеквизиты = Новый Массив;
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("ПроверятьЗаполнениеХарактеристики", Новый ОписаниеТипов("Булево"), ПутьКТЧ, "ПроверятьЗаполнениеХарактеристики", Истина));
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);

	НоваяКолонка = Форма.Элементы.Добавить(ИмяТЧ+"ПроверятьЗаполнениеХарактеристики", Тип("ПолеФормы"), Форма.Элементы[ИмяТЧ]);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода; 
	НоваяКолонка.ПутьКДанным = ПутьКТЧ + "." + "ПроверятьЗаполнениеХарактеристики";
	НоваяКолонка.Видимость = Ложь;
	
	ИмяПоляПроверятьЗаполнениеХарактеристики = "Объект."+ИмяТЧ+ ".ПроверятьЗаполнениеХарактеристики";
	
	ИмяПоляХарактеристики = ИмяПоляВводаХарактеристики;
	
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ИмяПоляПроверятьЗаполнениеХарактеристики, Истина, ВидСравненияКомпоновкиДанных.Равно);
	
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Истина);
	
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ИмяПоляПроверятьЗаполнениеХарактеристики, Ложь, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Ложь);
	
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект."+ИмяТЧ+".Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляХарактеристики);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

// Устанавливаем условное оформление для единиц измерения номенклатуры
//
// Параметры:
// 		Форма - Форма - Содержит данную форму
// 		ИмяПоляВводаЕдиницИзмерения - Строка - Наименование элемента формы, содержащего ед. измерения номенклатуры,
//									   			если оно отличается от "ТоварыНоменклатураЕдиницаИзмерения"
// 		ПутьКПолюОтбора - Строка - Полный путь к реквизиту "Упаковка",
//									если он отличается от "Объект.Товары.Упаковка".
//
Процедура УстановитьУсловноеОформлениеЕдиницИзмерения(Форма,
													  ИмяПоляВводаЕдиницИзмерения,
													  ПутьКПолюОтбора) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаЕдиницИзмерения].Имя);

	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбора);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);	
	
КонецПроцедуры

// Устанавливает условное оформление для поля "Серия".
//
// Параметры:
//	Форма - УправляемаяФорма - Форма, в которой нужно установить условное оформление,
//
Процедура УстановитьУсловноеОформлениеСерийНоменклатуры(Форма,
														ИмяПоляВводаСерии,
														ПутьКПолюОтбораСтатусУказанияСерий,
														ПутьКПолюОтбораТипНоменклатуры) Экспорт
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяПоляВводаСерии].Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПутьКПолюОтбораСтатусУказанияСерий);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<серии не используются>'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	ИмяТЧ = "";
	
	Если ИмяПоляВводаСерии = "ТоварыСерия" Тогда
		ПутьКТЧ = "Объект.Товары";
		ИмяТЧ = "Товары";
		
	ИначеЕсли ИмяПоляВводаСерии = "СырьеСерия" Тогда
		ПутьКТЧ = "Объект.Сырье";
		ИмяТЧ = "Сырье";
	Иначе Возврат;
	КонецЕсли;
	
	НовыеРеквизиты = Новый Массив;
	НовыеРеквизиты.Добавить(Новый РеквизитФормы("ПроверятьЗаполнениеСерии", Новый ОписаниеТипов("Булево"), ПутьКТЧ, "ПроверятьЗаполнениеСерии", Истина));
	Форма.ИзменитьРеквизиты(НовыеРеквизиты);

	НоваяКолонка = Форма.Элементы.Добавить(ИмяТЧ+"ПроверятьЗаполнениеСерии", Тип("ПолеФормы"), Форма.Элементы[ИмяТЧ]);
	НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода; 
	НоваяКолонка.ПутьКДанным = ПутьКТЧ + "." + "ПроверятьЗаполнениеСерии";
	НоваяКолонка.Видимость = Ложь;
	
	ИмяПоляПроверятьЗаполнениеСерии = "Объект."+ИмяТЧ+ ".ПроверятьЗаполнениеСерии";
	
	ИмяПоляСерии = ИмяПоляВводаСерии;
	
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ИмяПоляПроверятьЗаполнениеСерии, Истина, ВидСравненияКомпоновкиДанных.Равно);
	
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляСерии);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Истина);
	
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, ИмяПоляПроверятьЗаполнениеСерии, Ложь, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляСерии);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Ложь);
	
	НовоеУсловноеОформление = Форма.УсловноеОформление.Элементы.Добавить();
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект."+ИмяТЧ+".Серия", Справочники.ПартииНоменклатуры.ПустаяСсылка(), ВидСравненияКомпоновкиДанных.НеРавно);
	РаботаСФормой.ДобавитьОформляемыеПоля(НовоеУсловноеОформление, ИмяПоляСерии);
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

// Переопределяемая часть обработки проверки заполнения формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма.
//   Отказ - Булево - Истина если проверка заполнения не пройдена
//   ПроверяемыеРеквизиты - Массив Из Строка - реквизиты формы, отмеченные для проверки
Процедура ОбработкаПроверкиЗаполненияНаСервере(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Если Форма.ИмяФормы = "ОбщаяФорма.ФормаУточненияДанныхИС"
		Или Форма.ИмяФормы = "ОбщаяФорма.ФормаУточненияПодобраннойПродукцииИСМП" Тогда
		
		Номенклатура = Форма.Номенклатура;
		НепроверяемыеРеквизиты = Новый Массив;
		
		Если ЗначениеЗаполнено(Номенклатура) Тогда
			
			ЗначениеРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, 
				"ИспользоватьПартии, ПроверятьЗаполнениеПартий, ИспользоватьХарактеристики, ПроверятьЗаполнениеХарактеристики");
			
			Если НЕ (ЗначениеРеквизитов.ИспользоватьПартии И ЗначениеРеквизитов.ПроверятьЗаполнениеПартий) Тогда
				
				НепроверяемыеРеквизиты.Добавить("Серия");
			
			КонецЕсли;
			
			Если НЕ (ЗначениеРеквизитов.ИспользоватьХарактеристики И ЗначениеРеквизитов.ПроверятьЗаполнениеХарактеристики) Тогда
				
				НепроверяемыеРеквизиты.Добавить("Характеристика");
				
			КонецЕсли;
			
		Иначе
			
			НепроверяемыеРеквизиты.Добавить("Серия");
			НепроверяемыеРеквизиты.Добавить("Характеристика");
			
		КонецЕсли;
		
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
		
	КонецЕсли;
	
КонецПроцедуры

// Возникает на сервере при записи константы в формах настроек
// если запись одной константы может повлечь изменение других отображаемых в этой же форме.
//
// Параметры:
//  Форма             - ФормаКлиентскогоПриложения - форма,
//  КонстантаИмя      - Строка           - записываемая константа,
//  КонстантаЗначение - Произвольный     - значение константы.
Процедура ОбновитьФормуНастройкиПриЗаписиПодчиненныхКонстант(Форма, КонстантаИмя, КонстантаЗначение) Экспорт

	Если КонстантаИмя = "ВестиУчетМаркировкиПродукцииВГИСМ" И КонстантаЗначение Тогда
		
		Константы.ИспользоватьСерииНоменклатуры.Установить(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет действия при изменении номенклатуры в объекте (форме, строке табличной части итп).
//
// Параметры:
//  Форма                  - ФормаКлиентскогоПриложения - форма, в которой произошло событие,
//  ТекущаяСтрока          - Произвольный - контекст редактирования (текущая строка таблицы, шапка объекта, форма)
//  КэшированныеЗначения   - Неопределено, Структура - сохраненные значения параметров, используемых при обработке,
//  ПараметрыУказанияСерий - Произвольный - параметры указания серий формы
Процедура ПриИзмененииНоменклатуры(Форма, ТекущаяСтрока, КэшированныеЗначения = Неопределено, ПараметрыУказанияСерий = Неопределено) Экспорт
	
	Если Форма.ИмяФормы = "ОбщаяФорма.ФормаУточненияДанныхИС" 
		ИЛИ Форма.ИмяФормы = "Документ.МаркировкаТоваровИСМП.Форма.ФормаДокумента" Тогда
		
		ТекущаяСтрока.ХарактеристикиИспользуются = 
			ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") 
			И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) 
			И ТекущаяСтрока.Номенклатура.ИспользоватьХарактеристики;
		
		ТекущаяСтрока.СтатусУказанияСерий = ?(
			ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") 
			И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) 
			И ТекущаяСтрока.Номенклатура.ИспользоватьСерииНоменклатуры,
			1,
			0);
	
	КонецЕсли;
	
	СлужебныеРеквизиты = Новый Структура;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "ТребуетВзвешивания") Тогда
		СлужебныеРеквизиты.Вставить("ТребуетВзвешивания");
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "ПроизвольнаяЕдиницаУчета") Тогда
		СлужебныеРеквизиты.Вставить("ПроизвольнаяЕдиницаУчета");
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "СкоропортящаясяПродукция") Тогда
		СлужебныеРеквизиты.Вставить("СкоропортящаясяПродукция", ТекущаяСтрока.СкоропортящаясяПродукция);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекущаяСтрока, "ЕдиницаИзмерения") Тогда
		СлужебныеРеквизиты.Вставить("ЕдиницаИзмерения");
	КонецЕсли;
	
	Если СлужебныеРеквизиты.Количество() Тогда
		ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(Форма);
		ИнтеграцияИСУНФКлиентСервер.ЗаполнитьСлужебныеРеквизитыСтроки(Форма, ТекущаяСтрока, ПараметрыСканирования, СлужебныеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт
	
	Если Форма.КэшДанныхГОСИС = Неопределено Тогда
		Форма.КэшДанныхГОСИС = Новый Структура;
	КонецЕсли;
	
	СобытияФормИС.ПриЧтенииНаСервере(Форма, ТекущийОбъект);
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	Если Форма.КэшДанныхГОСИС =  Неопределено Тогда
		Форма.КэшДанныхГОСИС = Новый Структура;
	КонецЕсли;
	
	Если Форма.ИмяФормы = "Документ.ПередачаТоваровМеждуОрганизациями.Форма.ФормаДокумента"
		ИЛИ Форма.ИмяФормы = "Документ.РасходнаяНакладная.Форма.ФормаДокумента" Тогда
		ФОВестиУчетПодконтрольныхТоваровВЕТИС = ПолучитьФункциональнуюОпцию("ВестиУчетПодконтрольныхТоваровВЕТИС");
		Если ФОВестиУчетПодконтрольныхТоваровВЕТИС Тогда
			Форма.КэшДанныхГОСИС.Вставить("ИнтеграцияВЕТИС");
			ИнтеграцияИС.ПриСозданииНаСервереВФормеДокументаОснования(
				Форма,
				Форма.Объект,
				ИнтеграцияИС.ПараметрыИнтеграцииВФорме("ВетИС",ИнтеграцияИС.ИмяЭлементаДляРазмещения()));
		КонецЕсли;
		
	ИначеЕсли Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		Если НЕ ИнтеграцияИСУНФ.ИнициализацияФормыВыполнена(Форма, Ложь) Тогда
			Если Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияИСМП")
				Или Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияЕГАИС") Тогда
				ИмяЭлементаНастройки = "НастройкаПараметровНоменклатурыИС";
				ДобавляемыеРеквизиты = Новый Массив;
				ДобавляемыеРеквизиты.Добавить(
					Новый РеквизитФормы(ИмяЭлементаНастройки, Новый ОписаниеТипов("ФорматированнаяСтрока")));
				Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
				
				Элемент = Форма.Элементы.Вставить(
					ИмяЭлементаНастройки,
					Тип("ПолеФормы"),
					Форма.Элементы.ОсновныеРеквизиты,
					Форма.Элементы.ГруппаГабариты);
				Элемент.ПутьКДанным            = ИмяЭлементаНастройки;
				Элемент.ПоложениеЗаголовка     = ПоложениеЗаголовкаЭлементаФормы.Нет;
				
				ИнтеграцияИСУНФКлиентСервер.ЗаполнитьДанныеНастройкиПараметровНоменклатурыИС(Форма);
			КонецЕсли;
			
			Если Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияЕГАИС")
				И ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СоответствиеНоменклатурыЕГАИС) Тогда
				Элемент = Форма.Элементы.Вставить(
					"СопоставленнаяАлкогольнаяПродукция",
					Тип("ДекорацияФормы"),
					Форма.Элементы.ГруппаАлкогольнаяПродукция,);
				Элемент.Вид = ВидДекорацииФормы.Надпись;
				
				Элемент.Заголовок = ИнтеграцияЕГАИСУНФВызовСервера.ПредставлениеСопоставленнойАлкогольнойПродукция(
					Форма.Объект.Ссылка);
			КонецЕсли;
			
		КонецЕсли;
		
		// Заполним список выбора доступных видов продукции.
		Форма.Элементы.ВидПродукцииИС.СписокВыбора.Очистить();
		Если Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияЕГАИС") Тогда
			Форма.Элементы.ВидПродукцииИС.СписокВыбора.Добавить(Перечисления.ВидыПродукцииИС.Алкогольная);
		КонецЕсли;
		Если Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияИСМП") Тогда
			УчитываемыеВидыМаркируемойПродукции = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.УчитываемыеВидыМаркируемойПродукции();
			Для Каждого ВидПродукции Из УчитываемыеВидыМаркируемойПродукции Цикл
				Форма.Элементы.ВидПродукцииИС.СписокВыбора.Добавить(ВидПродукции);
			КонецЦикла;
		КонецЕсли;
		Если Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияВЕТИС") Тогда
			Форма.Элементы.ВидПродукцииИС.СписокВыбора.Добавить(Перечисления.ВидыПродукцииИС.ПодконтрольнаяПродукцияВЕТИС);
		КонецЕсли;
		Если Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияЗЕРНО") Тогда
			УчитываемыеВидыПродукцииЗЕРНО = ИнтеграцияЗЕРНОКлиентСерверПовтИсп.УчитываемыеВидыПродукции();
			Если Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияВЕТИС") Тогда
				УчитываемыеВидыПродукцииЗЕРНО = ИнтеграцияЗЕРНОКлиентСервер.РасширенныеВидыПродукции(УчитываемыеВидыПродукцииЗЕРНО);
			КонецЕсли;
			Для Каждого ВидПродукции Из УчитываемыеВидыПродукцииЗЕРНО Цикл
				Форма.Элементы.ВидПродукцииИС.СписокВыбора.Добавить(ВидПродукции);
			КонецЦикла;
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "КодОКПД2", "КнопкаВыбора", Ложь);
		КонецЕсли;
		Если Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияСАТУРН") Тогда
			Форма.Элементы.ВидПродукцииИС.СписокВыбора.Добавить(Перечисления.ВидыПродукцииИС.ПодконтрольнаяПродукцияСАТУРН);
		КонецЕсли;
		
		// Сохраним доступность ранее указанного значения.
		Если ЗначениеЗаполнено(Форма.Объект.ВидПродукцииИС)
			И Форма.Элементы.ВидПродукцииИС.СписокВыбора.НайтиПоЗначению(Форма.Объект.ВидПродукцииИС) = Неопределено Тогда
			Форма.Элементы.ВидПродукцииИС.СписокВыбора.Добавить(Форма.Объект.ВидПродукцииИС);
		КонецЕсли;
		Форма.Элементы.ВидПродукцииИС.СписокВыбора.СортироватьПоЗначению();
		
	КонецЕсли;
	
	СобытияФормИС.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма) Экспорт
	
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		Если Форма.Объект.Весовой
			И (Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияИСМП")
			Или Форма.КэшДанныхГОСИС.Свойство("ИнтеграцияЕГАИС")) Тогда
			
			ДанныеОписания = ОбщегоНазначенияИС.ИнициализироватьДанныеОписанияНоменклатуры();
			ДанныеОписания.Номенклатура = Форма.Объект.Ссылка;
			РегистрыСведений.ОписаниеНоменклатурыИС.УстановитьОписание(ДанныеОписания);
			
		КонецЕсли;
		
	КонецЕсли;
	
	СобытияФормИС.ПослеЗаписиНаСервере(Форма);
	
КонецПроцедуры

Процедура ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ Форма.КэшДанныхГОСИС.Свойство("Инициализация") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	Если Элемент = "ТабличнаяЧасть" Тогда
		ИдентификаторСтроки = Неопределено;
		Элемент = Форма.КэшДанныхГОСИС.ИмяТабличнойЧасти;
		
		Если ДополнительныеПараметры.Свойство("ТребуетсяЗаполнениеСлужебныхРеквизитов", ИдентификаторСтроки) Тогда
			ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(Форма);
			СлужебныеРеквизиты = Новый Структура("МаркируемаяПродукция, ВидПродукцииИС, КоэффициентЕдиницыИзмеренияГосИС, КоличествоВБазовыхЕдиницахГосИС,
				|АвтоматическийОСУИС, РазрешенОборотНемаркированныхОстатков, ДействуетКонтрольОборотаМарок");
			Если ИдентификаторСтроки = Неопределено Тогда
				ИнтеграцияИСУНФ.ЗаполнитьСлужебныеРеквизитыВКоллекции(Форма, Форма.Объект[Элемент], ПараметрыСканирования, СлужебныеРеквизиты);
			Иначе
				СтрокаТЧ = Форма.Объект[Элемент].НайтиПоИдентификатору(ИдентификаторСтроки);
				ИнтеграцияИСУНФКлиентСервер.ЗаполнитьСлужебныеРеквизитыСтроки(Форма, СтрокаТЧ, ПараметрыСканирования, СлужебныеРеквизиты);
			КонецЕсли;
		КонецЕсли;
		
		Если Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокумента"
			Или Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокумента_РМК" Тогда
			ДобавитьИзменитьКодМаркировкиКегаНаОборудованииРозлива(Форма, Элемент, ДополнительныеПараметры, ИдентификаторСтроки);
		КонецЕсли;
		
		Если ДополнительныеПараметры.Свойство("ТребуетсяЗаполнениеКэша") Тогда
			НастройкиКэша = ИнтеграцияИСУНФ.НастройкиИсточникаКешаЧека();
			ПроверкаИПодборПродукцииИС.ЗаполнитьКешШтрихкодовУпаковок(Форма, НастройкиКэша);
		КонецЕсли;
		
	КонецЕсли;
	
	СобытияФормИС.ПриИзмененииЭлемента(Форма, Элемент, ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьИзменитьКодМаркировкиКегаНаОборудованииРозлива(Форма, Элемент, ДополнительныеПараметры, ИдентификаторСтроки)
	
	СтрокаТЧ = Неопределено;
	Если Не ИдентификаторСтроки = Неопределено Тогда
		СтрокаТЧ = Форма.Объект[Элемент].НайтиПоИдентификатору(ИдентификаторСтроки);
		Если Не СтрокаТЧ.ВидПродукцииИС = Перечисления.ВидыПродукцииИС.Пиво Тогда
			Возврат;
		КонецЕсли;
		ТаблицаЗапасы = Форма.Объект.Запасы.Выгрузить(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтрокаТЧ));
	Иначе
		ТаблицаЗапасы = Форма.Объект.Запасы.Выгрузить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаЗапасы", ТаблицаЗапасы);
	Запрос.УстановитьПараметр("ТаблицаСерии", Форма.Объект.СерииНоменклатуры.Выгрузить());
	Запрос.УстановитьПараметр("ВидыПродукцииИСМП", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.ВидыПродукцииИС.Пиво));
	Запрос.Текст = ИнтеграцияИСУНФ.ТекстЗапросаТоварыСерии(ТаблицаЗапасы);
	
	Запасы = Запрос.Выполнить().Выгрузить();
	
	ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(Форма);
	Результат = ШтрихкодированиеИС.ДобавитьИзменитьКодМаркировкиВскрытойПотребительскойУпаковки(
		ПараметрыСканирования,
		Запасы,
		Форма.Объект[ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок]);
		
	Если Результат.ЕстьИзменения Тогда
		
		ДополнительныеПараметры.Вставить("ТребуетсяЗаполнениеКэша", Истина);
		
		ПараметрыПоиска = Новый Структура(ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки);
		Для Каждого ШтрихкодУпаковки Из Результат.УдалитьКодыМакрировки Цикл
			ПараметрыПоиска[ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки] = ШтрихкодУпаковки;
			ШтрихкодыУпаковок = Форма.Объект[ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок].НайтиСтроки(ПараметрыПоиска);
			Для Каждого СтрокаКУдалению Из ШтрихкодыУпаковок Цикл
				Форма.Объект[ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок].Удалить(СтрокаКУдалению);
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого КлючИЗначение Из Результат.КодыМаркировки Цикл
			
			СтрокаТовары   = КлючИЗначение.Ключ;
			ДанныеУпаковки = КлючИЗначение.Значение;
			
			Для Каждого СтрокаДанныхУпаковки Из ДанныеУпаковки Цикл
				ПараметрыПоиска[ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки] = СтрокаДанныхУпаковки.ШтрихкодУпаковки;
				ШтрихкодыУпаковок = Форма.Объект[ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок].НайтиСтроки(ПараметрыПоиска);
				Если ШтрихкодыУпаковок.Количество() = 0 Тогда
					ШтрихкодУпаковки = Форма.Объект[ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок].Добавить();
					Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ШтрихкодУпаковки, "КлючСвязи") Тогда
						ШтрихкодУпаковки.КлючСвязи = СтрокаТовары.КлючСвязи;
					КонецЕсли;
				Иначе
					ШтрихкодУпаковки = ШтрихкодыУпаковок[0];
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(ШтрихкодУпаковки, СтрокаДанныхУпаковки);
				ШтрихкодУпаковки[ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки] = СтрокаДанныхУпаковки.ШтрихкодУпаковки;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
